package com.company;
import java.util.Scanner;

    // TODO якщо ти хочеш перейменувати клас, то роби так (правою кнопкою по назві класу -> refactor -> rename)
class Testchat {

    public static void main(String args[]) {
        System.out.print("Привіт!");
        Scanner sc = new Scanner(System.in);
        /*
         TODO використай nextLine() метод замість next() для того щоб отримати значення яке введе користувач разом з пробілом.
         next() бере лише перше слово з рядка, тобто з фрази (Спави дуже добре) запишеться лише слово "Справи"
          */
        String phrase1 = sc.next();

        System.out.print("Як твої справи?");

        // TODO можеш перевикористати phrase1 = sc.next(); воно перезапише значення, щоб не створювати новий інстанс (теж саме nextLine())
        String phrase2 = sc.next();

        // TODO перероби всі варіанти в формі if -> else, а також врахуй витуацію, якщо користувач введе те що ти не очікуєш!
        if (phrase2.contains("добре") || phrase2.contains("супер") || phrase2.contains("прекрасно") || phrase2.contains("чудово")) {
            {
                System.out.println("Я радий, що в тебе все добре! Які плани на літо?");
                //break;
                // TODO Навіщо всередині if ще один блок {} ?
            }
        }

        // TODO Цикл без умов - опиши навіщо тут його застосовувати. Краще записати це в секції else
        while (phrase2.contains("погано") || phrase2.contains("зле") || phrase2.contains("недобре") || phrase2.contains("жахливо")) {
            {
                System.out.println("Не переживай, не існує проблем які не можна вирішити.");
                break;
            }// TODO Навіщо всередині ще один блок {} ?
        }

        // TODO можеш перевикористати phrase1 = sc.next();
        String phrase3 = sc.next();

        while (phrase3.contains("немає") || phrase2.contains("нікуди") || phrase2.contains("вдома")) {

            {   System.out.println("Тобі необхідно відпочити");
                break;
            } // TODO Навіщо всередині if ще один блок {} ?
        }
        while (phrase3.contains("море") || phrase2.contains("закордон") || phrase2.contains("океан")) {
            {  System.out.println("Бажаю тобі гарного відпочинку!");
                break;
            } // TODO Навіщо всередині if ще один блок {} ?
        }
        /*
        TODO Опиши наступний діалог бажано на англ.
        [c] відповіді які має надавати програма
        - Привіт! [c]
        - Привіт!
        - Що ви бажаєте щоб я зробив?
        Я вмію показувати час, рахувати нескладі метематичні операції, конвертувати $ у Є і навпаки а також підбирати імя для вашого улюбленця:[c]
        (Варіанти дій):
        1. Скажи мені час і дату (заюзай Date лібу)
            - Зараз (такато година і такато дата) [c]
        2. Скільки буде 25/10(для прикладу. реалізуй поведінку для /*-+)
            - Результат за вашим запитом 2.5 [c]
        3. Сконвертуй (число)$ до Є (курс може бути від фанаря) і також додай реалізацію дії навпаки
            - (число)$ = (число)Є за курсом (курс)  [c]
        4. Як мені назвати свого кота (потрібно створити колекцію імен і у відповідь рандомно видавати якесь значення)
            - (імя) прекрасно підійде для вашого улюбленця. [c]
            Після кожної дії знову виводити фразу 3 (з переліком всіх дій) і давати можливість юзати міні прогу поки юзер не напише слово 'Вихід'
         */
    }
}





